{"Datenschutz":{"slug":"Datenschutz","filePath":"Datenschutz.md","title":"Datenschutz","links":["mailto:info@itsnameless.de"],"tags":["hidden"],"content":"Datenschutzerklärung\n1. Datenschutz auf einen Blick\nAllgemeine Hinweise\nDie folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung.\nDatenerfassung auf dieser Website\nWer ist verantwortlich für die Datenerfassung auf dieser Website?\nDie Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten können Sie dem Abschnitt „Hinweis zur Verantwortlichen Stelle“ in dieser Datenschutzerklärung entnehmen.\nWie erfassen wir Ihre Daten?\nIhre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich z. B. um Daten handeln, die Sie in ein Kontaktformular eingeben. Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere IT- Systeme erfasst. Das sind vor allem technische Daten (z. B. Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs). Die Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten.\nWofür nutzen wir Ihre Daten?\nEin Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu gewährleisten. Andere Daten können zur Analyse Ihres Nutzerverhaltens verwendet werden. Sofern über die Website Verträge geschlossen oder angebahnt werden können, werden die übermittelten Daten auch für Vertragsangebote, Bestellungen oder sonstige Auftragsanfragen verarbeitet.\nWelche Rechte haben Sie bezüglich Ihrer Daten?\nSie haben jederzeit das Recht, unentgeltlich Auskunft über Herkunft, Empfänger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben außerdem ein Recht, die Berichtigung oder Löschung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, können Sie diese Einwilligung jederzeit für die Zukunft widerrufen. Außerdem haben Sie das Recht, unter bestimmten Umständen die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zuständigen Aufsichtsbehörde zu.\nHierzu sowie zu weiteren Fragen zum Thema Datenschutz können Sie sich jederzeit an uns wenden.\n2. Hosting\nWir hosten die Inhalte unserer Website bei folgendem Anbieter:\nIONOS\nAnbieter ist die IONOS SE, Elgendorfer Str. 57, 56410 Montabaur (nachfolgend IONOS). Wenn Sie unsere Website besuchen, erfasst IONOS verschiedene Logfiles inklusive Ihrer IP-Adressen. Details entnehmen Sie der Datenschutzerklärung von IONOS: www.ionos.de/terms-gtc/terms-privacy.\nDie Verwendung von IONOS erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Wir haben ein berechtigtes Interesse an einer möglichst zuverlässigen Darstellung unserer Website. Sofern eine entsprechende Einwilligung abgefragt wurde, erfolgt die Verarbeitung ausschließlich auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO und § 25 Abs. 1 TDDDG, soweit die Einwilligung die Speicherung von Cookies oder den Zugriff auf Informationen im Endgerät des Nutzers (z. B. Device-Fingerprinting) im Sinne des TDDDG umfasst. Die Einwilligung ist jederzeit widerrufbar.\nAuftragsverarbeitung\nWir haben einen Vertrag über Auftragsverarbeitung (AVV) zur Nutzung des oben genannten Dienstes geschlossen. Hierbei handelt es sich um einen datenschutzrechtlich vorgeschriebenen Vertrag, der gewährleistet, dass dieser die personenbezogenen Daten unserer Websitebesucher nur nach unseren Weisungen und unter Einhaltung der DSGVO verarbeitet.\n3. Allgemeine Hinweise und Pflichtinformationen\nDatenschutz\nDie Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung.\nWenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie persönlich identifiziert werden können. Die vorliegende Datenschutzerklärung erläutert, welche Daten wir erheben und wofür wir sie nutzen. Sie erläutert auch, wie und zu welchem Zweck das geschieht.\nWir weisen darauf hin, dass die Datenübertragung im Internet (z. B. bei der Kommunikation per E-Mail Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht\nmöglich.\nHinweis zur verantwortlichen Stelle\nDie verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist:\nLucas Hummitzsch\nc/o AutorenServices.de\nBirkenallee 24\n36037 Fulda\nE-Mail: info@itsnameless.de\nVerantwortliche Stelle ist die natürliche oder juristische Person, die allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z. B. Namen, E-Mail-Adressen o. Ä.) entscheidet.\nSpeicherdauer\nSoweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt. Wenn Sie ein berechtigtes Löschersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gelöscht, sofern wir keine anderen rechtlich zulässigen Gründe für die Speicherung Ihrer personenbezogenen Daten haben (z. B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die Löschung nach Fortfall dieser Gründe.\nAllgemeine Hinweise zu den Rechtsgrundlagen der Datenverarbeitung auf dieser Website\nSofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO bzw. Art. 9 Abs. 2 lit. a DSGVO, sofern besondere Datenkategorien nach Art. 9 Abs. 1 DSGVO verarbeitet werden. Im Falle einer ausdrücklichen Einwilligung in die Übertragung personenbezogener Daten in Drittstaaten erfolgt die Datenverarbeitung außerdem auf Grundlage von Art. 49 Abs. 1 lit. a DSGVO. Sofern Sie in die Speicherung von Cookies oder in den Zugriff auf Informationen in Ihr Endgerät (z. B. via Device-Fingerprinting) eingewilligt haben, erfolgt die Datenverarbeitung zusätzlich auf Grundlage von § 25 Abs. 1 TDDDG. Die Einwilligung ist jederzeit widerrufbar. Sind Ihre Daten zur Vertragserfüllung oder zur Durchführung vorvertraglicher Maßnahmen erforderlich, verarbeiten wir Ihre Daten auf Grundlage des Art. 6 Abs. 1 lit. b DSGVO. Des Weiteren verarbeiten wir Ihre Daten, sofern diese zur Erfüllung einer rechtlichen Verpflichtung erforderlich sind auf Grundlage von Art. 6 Abs. 1 lit. c DSGVO. Die Datenverarbeitung kann ferner auf Grundlage unseres berechtigten Interesses nach Art. 6 Abs. 1 lit. f DSGVO erfolgen. Über die jeweils im Einzelfall einschlägigen Rechtsgrundlagen wird in den folgenden Absätzen dieser Datenschutzerklärung informiert.\nEmpfänger von personenbezogenen Daten\nIm Rahmen unserer Geschäftstätigkeit arbeiten wir mit verschiedenen externen Stellen zusammen. Dabei ist teilweise auch eine Übermittlung von personenbezogenen Daten an diese externen Stellen erforderlich. Wir geben personenbezogene Daten nur dann an externe Stellen weiter, wenn dies im Rahmen einer Vertragserfüllung erforderlich ist, wenn wir gesetzlich hierzu verpflichtet sind (z. B. Weitergabe von Daten an Steuerbehörden), wenn wir ein berechtigtes Interesse nach Art. 6 Abs. 1 lit. f DSGVO an der Weitergabe haben oder wenn eine sonstige Rechtsgrundlage die Datenweitergabe erlaubt. Beim Einsatz von Auftragsverarbeitern geben wir personenbezogene Daten unserer Kunden nur auf Grundlage eines gültigen Vertrags über Auftragsverarbeitung weiter. Im Falle einer gemeinsamen Verarbeitung wird ein Vertrag über gemeinsame Verarbeitung geschlossen.\nWiderruf Ihrer Einwilligung zur Datenverarbeitung\nViele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt.\nWiderspruchsrecht gegen die Datenerhebung in besonderen Fällen sowie gegen Direktwerbung (Art. 21 DSGVO)\nWENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE JEDERZEIT DAS RECHT, AUS GRÜNDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG IHRER PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH FÜR EIN AUF DIESE BESTIMMUNGEN GESTÜTZTES PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER DATENSCHUTZERKLÄRUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN PERSONENBEZOGENEN DATEN NICHT MEHR VERARBEITEN, ES SEI DENN, WIR KÖNNEN ZWINGENDE SCHUTZWÜRDIGE GRÜNDE FÜR DIE VERARBEITUNG NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN ÜBERWIEGEN ODER DIE VERARBEITUNG DIENT DER GELTENDMACHUNG, AUSÜBUNG ODER VERTEIDIGUNG VON RECHTSANSPRÜCHEN (WIDERSPRUCH NACH ART. 21 ABS. 1 DSGVO).\nWERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS RECHT, JEDERZEIT WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER WERBUNG EINZULEGEN; DIES GILT AUCH FÜR DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG STEHT. WENN SIE WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER DIREKTWERBUNG VERWENDET (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO).\nBeschwerderecht bei der zuständigen Aufsichtsbehörde\nIm Falle von Verstößen gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbehörde, insbesondere in dem Mitgliedstaat ihres gewöhnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutmaßlichen Verstoßes zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe.\nRecht auf Datenübertragbarkeit\nSie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen. Sofern Sie die direkte Übertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist.\nAuskunft, Berichtigung und Löschung\nSie haben im Rahmen der geltenden gesetzlichen Bestimmungen jederzeit das Recht auf unentgeltliche Auskunft über Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empfänger und den Zweck der Datenverarbeitung und ggf. ein Recht auf Berichtigung oder Löschung dieser Daten. Hierzu sowie zu weiteren Fragen zum Thema personenbezogene Daten können Sie sich jederzeit an uns wenden.\nRecht auf Einschränkung der Verarbeitung\nSie haben das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Hierzu können Sie sich jederzeit an uns wenden. Das Recht auf Einschränkung der Verarbeitung besteht in folgenden Fällen:\n\nWenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten, benötigen wir in der Regel Zeit, um dies zu überprüfen. Für die Dauer der Prüfung haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.\nWenn die Verarbeitung Ihrer personenbezogenen Daten unrechtmäßig geschah/geschieht, können Siestatt der Löschung die Einschränkung der Datenverarbeitung verlangen.\nWenn wir Ihre personenbezogenen Daten nicht mehr benötigen, Sie sie jedoch zur Ausübung, Verteidigung oder Geltendmachung von Rechtsansprüchen benötigen, haben Sie das Recht, statt der Löschung die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.\nWenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abwägung zwischen Ihren und unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen überwiegen, haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.\n\nWenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschränkt haben, dürfen diese Daten – von ihrer Speicherung abgesehen – nur mit Ihrer Einwilligung oder zur Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen oder zum Schutz der Rechte einer anderen natürlichen oder juristischen Person oder aus Gründen eines wichtigen öffentlichen Interesses der Europäischen Union oder eines Mitgliedstaats verarbeitet werden.\nSSL- bzw. TLS-Verschlüsselung\nDiese Seite nutzt aus Sicherheitsgründen und zum Schutz der Übertragung vertraulicher Inhalte, wie zum Beispiel Bestellungen oder Anfragen, die Sie an uns als Seitenbetreiber senden, eine SSL- bzw. TLS- Verschlüsselung. Eine verschlüsselte Verbindung erkennen Sie daran, dass die Adresszeile des Browsers von „http://“ auf „https://“ wechselt und an dem Schloss-Symbol in Ihrer Browserzeile.\nWenn die SSL- bzw. TLS-Verschlüsselung aktiviert ist, können die Daten, die Sie an uns übermitteln, nicht von Dritten mitgelesen werden.\n4. Datenerfassung auf dieser Website\nCookies\nUnsere Internetseiten verwenden so genannte „Cookies“. Cookies sind kleine Datenpakete und richten auf Ihrem Endgerät keinen Schaden an. Sie werden entweder vorübergehend für die Dauer einer Sitzung (Session-Cookies) oder dauerhaft (permanente Cookies) auf Ihrem Endgerät gespeichert. Session-Cookies werden nach Ende Ihres Besuchs automatisch gelöscht. Permanente Cookies bleiben auf Ihrem Endgerät gespeichert, bis Sie diese selbst löschen oder eine automatische Löschung durch Ihren Webbrowser erfolgt.\nCookies können von uns (First-Party-Cookies) oder von Drittunternehmen stammen (sog. Third-Party- Cookies). Third-Party-Cookies ermöglichen die Einbindung bestimmter Dienstleistungen von Drittunternehmen innerhalb von Webseiten (z. B. Cookies zur Abwicklung von Zahlungsdienstleistungen).\nCookies haben verschiedene Funktionen. Zahlreiche Cookies sind technisch notwendig, da bestimmte Webseitenfunktionen ohne diese nicht funktionieren würden (z. B. die Warenkorbfunktion oder die Anzeige von Videos). Andere Cookies können zur Auswertung des Nutzerverhaltens oder zu Werbezwecken verwendet werden.\nCookies, die zur Durchführung des elektronischen Kommunikationsvorgangs, zur Bereitstellung bestimmter, von Ihnen erwünschter Funktionen (z. B. für die Warenkorbfunktion) oder zur Optimierung der Website (z. B. Cookies zur Messung des Webpublikums) erforderlich sind (notwendige Cookies), werden auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO gespeichert, sofern keine andere Rechtsgrundlage angegeben wird. Der Websitebetreiber hat ein berechtigtes Interesse an der Speicherung von notwendigen Cookies zur technisch fehlerfreien und optimierten Bereitstellung seiner Dienste. Sofern eine Einwilligung zur Speicherung von Cookies und vergleichbaren Wiedererkennungstechnologien abgefragt wurde, erfolgt die Verarbeitung ausschließlich auf Grundlage dieser Einwilligung (Art. 6 Abs. 1 lit. a DSGVO und § 25 Abs. 1 TDDDG); die Einwilligung ist jederzeit widerrufbar.\nSie können Ihren Browser so einstellen, dass Sie über das Setzen von Cookies informiert werden und Cookies nur im Einzelfall erlauben, die Annahme von Cookies für bestimmte Fälle oder generell ausschließen sowie das automatische Löschen der Cookies beim Schließen des Browsers aktivieren. Bei der Deaktivierung von Cookies kann die Funktionalität dieser Website eingeschränkt sein.\nWelche Cookies und Dienste auf dieser Website eingesetzt werden, können Sie dieser Datenschutzerklärung entnehmen.\nServer-Log-Dateien\nDer Provider der Seiten erhebt und speichert automatisch Informationen in so genannten Server-Log- Dateien, die Ihr Browser automatisch an uns übermittelt. Dies sind:\n\nBrowsertyp und Browserversion\nverwendetes Betriebssystem\nReferrer URL\nHostname des zugreifenden Rechners\nUhrzeit der Serveranfrage\nIP-Adresse\n\nEine Zusammenführung dieser Daten mit anderen Datenquellen wird nicht vorgenommen.\nDie Erfassung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Der Websitebetreiber hat ein berechtigtes Interesse an der technisch fehlerfreien Darstellung und der Optimierung seiner Website – hierzu müssen die Server-Log-Files erfasst werden.\nKontaktformular\nWenn Sie uns per Kontaktformular Anfragen zukommen lassen, werden Ihre Angaben aus dem Anfrageformular inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen bei uns gespeichert. Diese Daten geben wir nicht ohne Ihre Einwilligung weiter.\nDie Verarbeitung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO, sofern Ihre Anfrage mit der Erfüllung eines Vertrags zusammenhängt oder zur Durchführung vorvertraglicher Maßnahmen erforderlich ist. In allen übrigen Fällen beruht die Verarbeitung auf unserem berechtigten Interesse an der effektiven Bearbeitung der an uns gerichteten Anfragen (Art. 6 Abs. 1 lit. f DSGVO) oder auf Ihrer Einwilligung (Art. 6 Abs. 1 lit. a DSGVO) sofern diese abgefragt wurde; die Einwilligung ist jederzeit widerrufbar.\nDie von Ihnen im Kontaktformular eingegebenen Daten verbleiben bei uns, bis Sie uns zur Löschung auffordern, Ihre Einwilligung zur Speicherung widerrufen oder der Zweck für die Datenspeicherung entfällt (z. B. nach abgeschlossener Bearbeitung Ihrer Anfrage). Zwingende gesetzliche Bestimmungen – insbesondere Aufbewahrungsfristen – bleiben unberührt.\nAnfrage per E-Mail \nWenn Sie uns per E-Mail kontaktieren, wird Ihre Anfrage inklusive aller daraus hervorgehenden personenbezogenen Daten (Name, Anfrage) zum Zwecke der Bearbeitung Ihres Anliegens bei uns gespeichert und verarbeitet. Diese Daten geben wir nicht ohne Ihre Einwilligung weiter.\nDie Verarbeitung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO, sofern Ihre Anfrage mit der Erfüllung eines Vertrags zusammenhängt oder zur Durchführung vorvertraglicher Maßnahmen erforderlich ist. In allen übrigen Fällen beruht die Verarbeitung auf unserem berechtigten Interesse an der effektiven Bearbeitung der an uns gerichteten Anfragen (Art. 6 Abs. 1 lit. f DSGVO) oder auf Ihrer Einwilligung (Art. 6 Abs. 1 lit. a DSGVO) sofern diese abgefragt wurde; die Einwilligung ist jederzeit widerrufbar.\nDie von Ihnen an uns per Kontaktanfragen übersandten Daten verbleiben bei uns, bis Sie uns zur Löschung auffordern, Ihre Einwilligung zur Speicherung widerrufen oder der Zweck für die Datenspeicherung entfällt (z. B. nach abgeschlossener Bearbeitung Ihres Anliegens). Zwingende gesetzliche Bestimmungen – insbesondere gesetzliche Aufbewahrungsfristen – bleiben unberührt.\n\n5. Plugins und Tools\n\nGoogle Fonts\nDiese Seite nutzt zur einheitlichen Darstellung von Schriftarten so genannte Google Fonts, die von Google bereitgestellt werden. Beim Aufruf einer Seite lädt Ihr Browser die benötigten Fonts in ihren Browsercache, um Texte und Schriftarten korrekt anzuzeigen.\nZu diesem Zweck muss der von Ihnen verwendete Browser Verbindung zu den Servern von Google aufnehmen. Hierdurch erlangt Google Kenntnis darüber, dass über Ihre IP-Adresse diese Website aufgerufen wurde. Die Nutzung von Google Fonts erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Der Websitebetreiber hat ein berechtigtes Interesse an der einheitlichen Darstellung des Schriftbildes auf seiner Website. Sofern eine entsprechende Einwilligung abgefragt wurde, erfolgt die Verarbeitung ausschließlich auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO und § 25 Abs. 1 TDDDG, soweit die Einwilligung die Speicherung von Cookies oder den Zugriff auf Informationen im Endgerät des Nutzers (z. B. Device-Fingerprinting) im Sinne des TDDDG umfasst. Die Einwilligung ist jederzeit widerrufbar.\nWenn Ihr Browser Google Fonts nicht unterstützt, wird eine Standardschrift von Ihrem Computer genutzt.\nWeitere Informationen zu Google Fonts finden Sie unter\ndevelopers.google.com/fonts/faq und in der Datenschutzerklärung von Google:\npolicies.google.com/privacy\nDas Unternehmen verfügt über eine Zertifizierung nach dem „EU-US Data Privacy Framework“ (DPF). Der DPF ist ein Übereinkommen zwischen der Europäischen Union und den USA, der die Einhaltung europäischer Datenschutzstandards bei Datenverarbeitungen in den USA gewährleisten soll. Jedes nach dem DPF zertifizierte Unternehmen verpflichtet sich, diese Datenschutzstandards einzuhalten. Weitere Informationen hierzu erhalten Sie vom Anbieter unter folgendem Link:\nwww.dataprivacyframework.gov/participant/5780.\nErstellt mit e-recht24 Datenschutzerklärung Generator"},"Impressum":{"slug":"Impressum","filePath":"Impressum.md","title":"Impressum","links":["Kontakt","mailto:info@itsnameless.de"],"tags":["hidden"],"content":"Impressum\nLucas Hummitzsch\nc/o AutorenServices.de\nBirkenallee 24\n36037 Fulda\nBitte senden Sie keine Brief- oder Paketsendungen an diese Postanschrift, sofern dies nicht dringend notwendig ist! Sollten Sie dies dennoch wünschen, dann nehmen Sie bitte über das Kontaktformular Kontakt auf und wir werden eine Lösung finden.\nKontakt\nE-Mail: info@itsnameless.de\nDiese E-Mail-Adresse dient ausschließlich für offizielle Zwecke! Bitte nutzen Sie zum anderweitigen Kontakt das Kontaktformular.\nRedaktionell verantwortlich\nLucas Hummitzsch\nc/o AutorenServices.de\nBirkenallee 24\n36037 Fulda\nBitte senden Sie keine Brief- oder Paketsendungen an diese Postanschrift, sofern dies nicht dringend notwendig ist! Sollten Sie dies dennoch wünschen, dann nehmen Sie bitte über das Kontaktformular Kontakt auf und wir werden eine Lösung finden.\nErstellt mit e-recht24 Impressum Generator"},"Kontakt":{"slug":"Kontakt","filePath":"Kontakt.md","title":"Kontaktformular","links":[],"tags":["hidden"],"content":"Bitte nutze dieses Formular wenn du Fragen, Anregungen oder ähnliches hast. Ich freue mich, dir zu antworten!\n\n    \n        \n        \n    \n"},"Lizenz":{"slug":"Lizenz","filePath":"Lizenz.md","title":"Lizenz","links":["Kontakt"],"tags":["hidden"],"content":"Sofern nicht anders angegeben, unterliegen alle Inhalte dieser Seite der Lizenz\nCreative Commons BY-NC-ND 4.0.\nSie dürfen für nichtkommerzielle Zwecke genutzt werden, solange die Quelle (“ItsNameless” sowie die Webseite “itsnameless.de”) genannt wird und keine Veränderungen ohne entsprechende Kennzeichnung vorgenommen werden. Kommerzielle Nutzung ist nur mit vorheriger Zustimmung erlaubt. In diesem Fall kontaktiere mich bitte über das Kontaktformular."},"Technik-Ecke/Blog-aufsetzen-leicht-gemacht":{"slug":"Technik-Ecke/Blog-aufsetzen-leicht-gemacht","filePath":"Technik-Ecke/Blog aufsetzen leicht gemacht.md","title":"Blog aufsetzen leicht gemacht","links":[],"tags":["how-to","server","blogging"],"content":"Puh…, da hat man sich mal entschieden, einen Blog zu schreiben, aber hat absolut keinen Plan, wo man anfängt… doch damit ist jetzt Schluss, mit dem Nameless-Blog-Tutorial! Kommt mit mir auf eine Reise durch die weite Welt der Blogging-Tools, Webseiten und, ja, deutschem Recht!\nDie Idee - Wozu schreibt man einen Blog?\nUm überhaupt einen Blog schreiben zu wollen, braucht man zunächst eine Idee.\nAls ich began, meinen Raspberry Pi aufzusetzen, hatte ich recht wenig Erfahrung mit solchen Angelegenheiten.\nWie installiere ich Container? Wie richtet man SSL ein? Wie kann ich meine Dienste von überall aus erreichen?\nIch stellte mir viele solcher Fragen. Schnell waren Antworten gefunden (wozu gibt es sonst das Internet), doch genau so schnellen traten Fehler auf, wozu ich keine direkte Antwort fand. So began eine oft gefühlt unendlich lange Suche nach der Lösung, die glücklicherweise schlussendlich doch in einem Erfolg endete. Geholfen haben dabei vor allem Blogs (Shout-out an digital cleaning), die einem Tipps und Lösungen gaben. Leider sind diese Infos sehr verteilt und nicht gerade strukturiert - eine Sammlung musste her.\nIch entschied mich, meine Abenteuer, ebenso wie andere Blogger, mit der Welt zu teilen und so anderen dabei zu helfen, ähnliche Probleme wie ich habe zu lösen. Vielleicht stellst du dir gerade die selben Fragen, wie ich sie mir stellte und vielleicht helfen dir meine Posts, ähnliche Probleme zu lösen.\nDie Umsetzung - Wie schreibe ich nun einen Blog?\nDie Idee war geboren - jetzt folgt die Umsetzung. Da ich bereits einen Server habe  und Obsidian für alle meinen Notizen nutze - welcher einen sehr hübschen, aber teuren publish Service hat - wollte ich eine selbstgehostete Alternative dazu nutzen.\nNach einer recht kurzen Suche stieß ich auf einen interessanten Reddit Post, der genau diese Frage beantworten sollte. Mein Tool der Wahl wurde also Quartz, ein sehr schöner SSG1, der sehr nah an Obsidian Publish ist - sowohl im Design als auch im Featureumfang.\nQuartz Setup - Die Basics\nQuartz ist recht einfach zu nutzen, eine detailierte Anleitung ist in der Dokumentation zu finden. Man cloned das Git-Repository, initialisiert ein npm-Projekt mit npm init und kann sich seine Inhalte mittels npx quartz build --serve lokal anschauen. Die fertige Seite lässt sich einfach mittels einem eigenen Git-Repository teilen und mittels einer Anleitung kann man auf bekannten Seiten, wie Cloudflare oder Github Pages seine Seite hosten.\nIch habe nun aber einen eigenen Server. Und das Prinzip, das gesamte Quartz-Repository mittels Git zu syncen gefällt mir garnicht. Ich hätte gerne ein strukturiertes Repository, mit den Config-Dateien und den Seiten, welches automatisch in statische HTML-Seiten gebaut wird und so einfach gehostet werden kann. Wie gut, dass wir Ahnung von Computern haben!\nLink Magic - Eine Prise Perfektion\nEin strukturiertes Git-Repository\nDas Prinzip, immer das gesamte Quartz-Repository zu Clonen führt zu ziemlich viel Bloat, wenn man einfach seine Website mittels Git synchronisieren möchte. Tatsächlich sind die einzigen Dateien, die man selber anfassen muss:\n\ndie Markdown-Seiten in quartz/content\ndie Konfigurationsdateien quartz/quartz.config.ts und quartz/quartz.layout.ts\ncustom Components in quartz/components\ncustom Styles in quartz/styles\n\nDrei Ordner und zwei Dateien? Mehr nicht? - Ja, mehr nicht. Der Rest ist Krams den Quartz zum bauen deiner Seite benötigt. Zum Aufräumen und lokalem Testen reicht es also, einen extra Ordner zu erstellen und dort einfach diese Ordner zu kopieren. Ich habe dann ein eigenes Git-Repository erstellt, diese Ordner dort hinein verschoben und mittels Symbolic Links2 mit den Ordnern im eigentlichen Quartz-Ordner verknüpft.\nQuartz Ordnersystem\nquartz\n\tcontent     # Hier liegen die .md Dateien zum bauen\n\t\t...\n\tquartz\n\t\tcomponents # Hier liegen zusätzliche Components\n\t\t\t...\n\t\tstyles    # Hier liegen zusätzliche Styles\n\t\t\t...\n\tquartz.config.ts\n\tquartz.layout.ts\n\t...         # Weitere, uninteressante Dateien\nMein Ordnersystem\nrepository  # Mein neuer Ordner, den ich auf Git synce\n\tcontent # Verlinkung von quartz/content\n\t.config # Enthält alle Config-Dateien\n\t\tcomponents\n\t\tstyles\n\t\tquartz.config.ts\n\t\tquartz.layout.ts\nBefehl zum Erstellen der Links\nln -sf /path/to/repository/content /path/to/quartz/content\n# Verlinkt den /repository/content Ordner mit einem content Ordner im aktuellen Pfad\n# -s : Symoblic Link\n# -f : Überschreibe einen eventuell existierenden content Ordner im aktuellen Pfad\nNun lässt sich das Git-Repository auf eine Git-Platform wie GitHub pushen - et voilà - ein übersichtliches Repository!\nDer Weg zum Auto Build\nJetzt soll der Blog bei jedem Push automatisch gebaut werden. Dafür müssen natürlich die fehlenden Quartz-Dateien wieder eingefügt werden, und die gebauten HTML-Dateien auf eine eigene Branch gepusht werden. Genau dafür gibt es GitHub Actions!\nDie Action musste also bei jedem Push auf main laufen, die Seiten bauen und auf die publish Branch pushen. Wer noch nie GitHub Actions genutzt hat, dem gebe ich hier eine kurze Erklärung meines Scripts:\nname: Deploy Quartz Site                  # Der Name des Skripts\n \non:                                       # Wann wird dieses Skript ausgeführt?\n  push:                                   # Wenn auf main gepusht wird\n    branches:\n      - main\n \njobs:                                     # Dann führe die folgenden Aufgaben aus\n  deploy:                                 # Name der Aufgabe ist &quot;deploy&quot;\n    runs-on: ubuntu-latest\n    permissions:\n        contents: write\n    steps:\n      - name: Checkout current repository # Klone dieses Repository in den Ordner &quot;content-repo&quot;\n        uses: actions/checkout@v4\n        with:\n          path: content-repo\n \n      - name: Setup Node.js                # Setze Node.js mit Version 20 auf\n        uses: actions/setup-node@v4\n        with:\n          node-version: &#039;20&#039;\n \n      - name: Clone Quartz                 # Klone das Quartz Repository und installiere die Dependencies\n        run: |\n          git clone github.com/jackyzha0/quartz.git\n          cd quartz\n          npm install\n          \n      - name: Copy content                  # Kopiere den Content aus dem content-repo in das build-repo\n        run: |\n          rm -rf quartz/content/\n          mkdir -p quartz/content/\n          cp -r content-repo/content/* quartz/content/\n \n      - name: Copy config                    # Kopiere auch die Config\n        run: |\n          cp -r content-repo/.config/* quartz/\n \n      - name: Build site                     # Baue die HTML-Seiten\n        run: |\n          cd quartz\n          npx quartz build\n \n      - name: Push to publish branch         # Commite und pushe die gebauten Seiten in &quot;quartz/public&quot; als github-actions Nutzer auf die &quot;publish&quot; Branch\n        run: |\n          git config --global user.name &#039;github-actions[bot]&#039;\n          git config --global user.email &#039;github-actions[bot]@users.noreply.github.com&#039;\n          cd quartz/public\n          git init\n          git add -A\n          git commit -m &quot;Deploy built site&quot;\n          git push -f &quot;https://x-access-token:${{ secrets.GITHUB_TOKEN }}@github.com/${{ github.repository }}.git&quot; HEAD:publish\nWenn dieses Skript nun im Repository unter .github/workflows/build.yml abgelegt wird, wird automatisch bei jedem Push auf main das Projekt gebaut und in die Branch publish veröffentich. Diese statische Seite kann ganz einfach auf einem Server, mit GitHub Pages oder was es sonst noch gibt veröffentlicht werden!\nDeutsches Recht - Bitte was?\nDer nachfolgende Abschnitt ist keine rechtliche Beratung. Bei konkreten Fragen sollte stets ein Anwalt konsultiert werden.\nFun Fact - Tatsächlich kann nicht jeder einfach so eine Website im Internet veröffentlichen, ohne dafür verantwortlich zu sein. Deshalb schreibt das Deutsche Recht einige Bedingungen vor, um eine Website, zum Beispiel einen Blog, zu veröffentlichen. Nicht jeder kann sich einigen, was man genau beachten muss, welche Gesetze nun wirklich auf einen zutreffen und wie detailiert diese Angaben sein müssen.\nAll das klingt erstmal komplizierter als es ist. Ich fasse hier einmal kurz einige Dinge zusammen, die ich für sehr wichtig halte:\nImpressumspflicht\nNach dem §5 des Digitale-Dienste-Gesetz hat jeder Betreiber einer in der Regel gegen Entgelt angebotenen Webseite gewisse Kontaktinformationen bereitzustellen. Was ist in der Regel? Zählt mein Blog dazu, der vielleicht irgendwann mal Werbung schaltet?\nUnabhängig davon, will man auf Nummer sicher gehen. Deshalb - Impressum. Dazu gehören:\n\nName und Anschrift des Betreibers\nAngaben für eine schnelle3 elektronische Kontaktaufnahme\nweitere Informationen, sollte der Dienst beruflich / von einer juristischen Person angeboten werden\n\nWer seine Privatsphäre nicht völlig preisgeben möchte, der kann auch hier einige Kniffe anwenden: Als Adresse zählt jede ladungsfähige Adresse, über die man direkt postalisch erreicht werden kann. Das darf zwar kein Postfach sein, in das man nicht regelmäßig hineinschaut, muss aber auch nicht deine private Hausanschrift sein. Ich entschied mich für einen sogenannten Impressumsservice4. Nach langer Recherche und Kostenabwägung stieß ich auf autorenservices, welche für knapp 30€ für vier Jahre eine Adresse zur Verfügung stellen, welche man in seinem Impressum nutzen kann. Da ich keine zu großen Postmengen erwarte, ist dieser Service genau richtig für mich!\nDatenschutz\nJeder Dienstanbieter, der Daten verarbeitet, muss nach der DSGVO Informationen über eben jene Verarbeitung bereitstellen.\nBlogs werden zumeist im Internet gehostet, und dort laufen die Daten über einen Dienstanbieter. In meinem Fall ist das Ionos, und ja, die verarbeiten Daten!\nDa ich nicht gerade viel Zeit und Lust habe, eine eigene Datenschutzerklärung zu schreiben, nahm ich mir den eRecht24 Datenschutz-Generator zur Hand und in wenigen Minuten hatte ich eine hoffentlich ausreichende Datenschutzerklärung parat!\nUrheberrecht\nWer sich die Mühe macht, Inhalte zu veröffentlichen, sollte anderen auch mitteilen, wie diese zu verwenden sind. Dafür gibt es sehr viele Lizenzmodelle, die alle verschiedenstes erlauben. Der creative commons license chooser ist ein sehr hilfreiches Tool, um die passende Lizenz zu finden. Ich entschied mich für CC BY-NC-ND:\n\nBY: Der Autor muss stets erwähnt werden\nNC: Die Inhalte dürfen nicht (ohne ausdrückliche Erlaubnis) für kommerzielle Zwecke genutzt werden\nND: Die Inhalte dürfen nicht (ohne ausdrückliche Kennzeichnung) modifiziert werden\n\nJedem steht natürlich frei seine Werke anders zu lizenzieren.\nOutro\nSo, ich hoffe ihr habt einen recht ausführlichen Einblick in die Welt der Blogs erhalten. Vielleicht habt ihr euch die Mühe gemacht, einen eigenen Blog aufzusetzen und euer Wissen mit der Welt zu teilen. Und falls nicht, dann hoffe ich, dass ihr zumindest viel Spaß beim lesen meines ersten Blogeintrags hattet!\nWie dem auch sei, bis zum nächsten Mal!\nFootnotes\n\n\nStatic Site Generator - Tool, dass aus simpel formatierten Dokumenten (z.B. Markdown) schöne HTML-Seiten erstellt. ↩\n\n\nSymbolische Verknüpfung - Verlinkung zweier Dateien / Ordner, damit die Inhalte einfach synchronisiert werden können, ohne sie ständig manuell zu kopieren. ↩\n\n\nSchnell? Heißt das E-Mail, Telefon, vielleicht ein Kontaktformular? Auch das ist Auslegungssache, aber zum Schutz der Privatsphäre verzichte ich auf eine Telefonnummer, da ich regelmäßig meine E-Mails kontrolliere. ↩\n\n\nEin Dienst, der eine ladungsfähige Adresse zur Verfügung stellt und eventuelle Post gegen eine geringe Gebühr an dich weiterleitet. ↩\n\n\n"},"Technik-Ecke/Homer---Ein-Dashboard-für-dein-Server":{"slug":"Technik-Ecke/Homer---Ein-Dashboard-für-dein-Server","filePath":"Technik-Ecke/Homer - Ein Dashboard für dein Server.md","title":"Homer - Ein Dashboard für dein Server","links":[],"tags":["how-to","server"],"content":"Jaja, Services aufsetzen macht Spaß. Aber Moment mal, welche Services habe ich den nun eigentlich? Und wie sind sie erreichbar?\nDie Übersicht über seine Services zu erhalten ist genau so wichtig wie aufwendig. Klar, die Browser-Autovervollständigung hilft einem da ganz schön, aber vergisst man mal die Subdomain dann beginnt die große Suche. Eine Übersicht muss her, am besten ein simples Dashboard.\nGenau das macht Homer!\nÄäh, Homer?\nDer Name mag verwirrend sein, doch selbsterklärend ist er dazu:\n\nA dead simple static HOMepage for your servER to keep your services on hand, from a simple yaml configuration file.\n\nDieses Tool erlaubt es, schnell ein Dashboard für verschiedene Services zu erstellen, um den Überblick zu behalten.\n\nNicht wundern über die leeren Felder, für meine Privatsphäre habe ich diese geschwärzt.\nJa aber wie denn nun?\nDer Get Started-Guide auf dem Repository ist sehr übersichtlich gestaltet und das Dashboard steht schnell. Möchte man nun seine eigenen Services hinzufügen, so folgt man einfach dem Configuration-Guide.\nDa das alles selbsterklärend ist, folgen nun ein paar Tipps und Tricks, damit auch du das meiste aus Homer herausholen kannst!\nSchneller Zugriff - Einfach per Neuer Tab\nDer neue Tab ist ganz schnell geöffnet und zeigt - Google (natürlich gibt es auch Bing, DuckDuckGo, …). Das mag für viele reichen, aber wir sind Power User. Wie schön wäre es, wenn wir unser Dashboard direkt dort sehen?\nAuch dafür gibt es natürlich eine Anleitung von Homer! Leider hat diese bei mir ständig zu einem Fehler geführt, wenn ich auf die Links im Dashboard geklickt habe:\n\nFirefox - Warum nur?\nDas von Homer vorgeschlagene Firefox-AddOn1 nutzt iFrames2 um die Services auf unserem Dashboard im gleichen Tab anzuzeigen. Dies erlaubt uns, die Suchleiste unseres Browsers einfach zu und so schnell Suchen zu machen.\nDa iFrames aber auch zu bösen Zwecken missbraucht werden können3 erlauben viele Webseiten es nicht, einfach überall eingebettet zu werden. Somit blockiert Firefox den Aufruf.\nDies erreicht eine Webseite, indem diese einen Header x-frame-options: DENY mitsendet, und somit das Einbetten auf jeglichen anderen Webseiten verbietet. Um das Einbetten auf bestimmten Webseiten zu erlauben, müssen jedoch folgende Header mitgeschickt werden:\ncustomFrameOptionsValue: &quot;ALLOW-FROM &lt;origin&gt;&quot;\ncontentSecurityPolicy: &quot;frame-ancestors &#039;self&#039; &lt;origin&gt;&quot;\n\nWelche Website muss ich nehmen?\nJetzt kommt die große Frage: Welche Webseite versucht den nun, unsere Services einzubetten?\nDa unser Browser-AddOn diese Seite einbettet, benötigen wir dessen URL als Origin. Um diese herauszufinden öffnen wir einen neuen Tab, dann die Konsole des Browsers und geben dort den Befehl ein:\nconsole.log(window.location.origin);\nAls Antwort erhalten wir eine URL, welche dem folgenden Format entspricht:\nmoz-extension://&lt;guid&gt;\n\nDiese URL können wir jetzt an Stelle von &lt;origin&gt; einsetzen.\nEin Fix für Traefik\nWer auch Traefik nutzt kann diese Header nun einfach für alle Services setzen. Dafür erstelle man eine Middleware4 in seiner dynamic.yml und fügt folgende Informationen ein:\nhttp:\n    middlewares:\n\t\tiframe-allow-dashboard:\n            headers:\n                customFrameOptionsValue: &quot;ALLOW-FROM &lt;origin&gt;&quot;\n                contentSecurityPolicy: &quot;frame-ancestors &#039;self&#039; &lt;origin&gt;&quot;\nDiese Middleware kann nun standardmäßig für alle Services im passenden entryPoint5 in der static.yml hinzugefügt werden:\nentryPoints:\n    websecure:\n        address: &#039;:443&#039;\n        http:\n            middlewares:\n                - iframe-allow-dashboard@file\nNach einem Neustart sollten alle Services die passenden Header gesetzt haben und über Homer funktionieren!\nUnd was ist mit anderen Webseiten?\nSo schön dieser Fix auch ist, uns ist es nicht möglich einfach den Quellcode anderer Webseiten zu bearbeiten um diese Header zu setzen.\nUm nun aber auch fremde Seiten in Homer anzuzeigen und diese über einen Neuen Tab öffnen zu können, müssen wir sagen, dass Firefox diese in einem neuen Tab öffnen soll. Dies kann durch die Konfiguration target=&quot;_blank&quot; erreicht werden:\nservices:\n  - name: &quot;General&quot;\n    icon: &quot;fas fa-star&quot;\n    items:\n      - name: &quot;Externe Webseite&quot;\n        logo: &quot;assets/tools/logo.png&quot;\n        url: &quot;beispiel.de/&quot;\n        target: &quot;_blank&quot;\nEin Klick und schon ist die Webseite in einem neuen Tab geöffnet!\nPing für Alle\nWer sich mit Homer auseinandergesetzt hat, sollte die Ping Smart Card kennen. Mit dieser lässt sich einfach anzeigen, ob Services online sind.\n\nUm die selbe Config nicht ständig bei jedem Service neu hinzufügen zu müssen, können YAML Anchors6 verwendet werden. Man definiert einen Anchor zu Beginn und nutzt diesen bei allen Services, die Ping nutzen sollen:\nDefinition:\nanchors:\n  Ping: &amp;Ping  # Hinter dem &amp; den Namen des Anchors definieren\n    - type: &quot;Ping&quot;\n      successCodes: [200, 301, 302, 401]\nNutzung:\nservices:\n  - name: &quot;General&quot;\n    icon: &quot;fas fa-star&quot;\n    items:\n      - name: &quot;Authelia SSO&quot;\n        logo: &quot;assets/tools/authelia.png&quot;\n        url: &quot;authelia.yourdomain.com&quot;\n        &lt;&lt;: *Ping  # Mit dem Namen alle Attribute des Anchors einfügen\nSchlusswort\nOrdnung kann so einfach sein, man muss es nur wollen! Mit Homer ist Ordnung ein Kinderspiel. Ich hoffe, ich habe euch überzeugt euch selbst ein Bild zu machen und euren Alltag mit Homer zu erleichtern. Bis nächstes mal!\nFootnotes\n\n\nFirefox Custom-New-Tab-Page ↩\n\n\n&lt;iframe&gt;: Das Inline-Frame-Element - HTML | MDN ↩\n\n\nWhy are iframes considered dangerous and a security risk? | Stackoverflow ↩\n\n\nTraefik Middleware - Middlewares erlauben es, bestimmte Operationen an den Requests und Responses vorzunehmen, um zum Beispiel Authorisation hinzuzufügen oder Header zu bearbeiten. ↩\n\n\nTraefik EntryPoints - Ein EntryPoint sagen Traefik, auf welchem Port und mit welchem Protokoll Anfragen entgegengenommen werden sollen. ↩\n\n\nDon’t Repeat Yourself with Anchors, Aliases and Extensions in Docker Compose Files | by King Chung Huang | Medium ↩\n\n\n"},"Technik-Ecke/Private-Registries-in-n8n---Nur-Besser":{"slug":"Technik-Ecke/Private-Registries-in-n8n---Nur-Besser","filePath":"Technik-Ecke/Private Registries in n8n - Nur Besser.md","title":"Private Registries in n8n - Nur Besser","links":[],"tags":["how-to","server","automation","n8n"],"content":"Nicht selten kommt es vor, dass man Prozesse ständig wiederholt. Ob alte E-Mails löschen, sich seine Werbemails zusammenfassen zu lassen, oder vieles weitere. Das alles lässt sich einfach automatisieren. Ein bekanntes Tool ist n8n, welches eine Vielzahl von integrierten und Community-Nodes hat. Doch manche Use-Cases sind einfach zu speziell und benötigen eigene Nodes.\nn8n-Customization leicht gemacht - Community Nodes\nDer offizielle Weg\nCommunity Nodes sind eine Möglichkeit, mit Typescript einfach eigene Nodes zu erstellen und so die Funktionalität von n8n zu erweitern. Um eigene Nodes zu publishen bietet n8n einen Guide. Dieser bietet zwei Möglichkeiten, Custom n8n-Nodes zu installieren:\n\nauf npm1 veröffentlichen und approven lassen\nin das Docker-Image kopieren und bauen\n\nDie Nachteile der offiziellen Wege\nBeide Möglichkeiten sind eher beschränkt nützlich für private Nodes, da diese:\n\neine Veröffentlichung erfordern oder\ndas Image ständig automatisiert neu gebaut werden muss\n\nWie gut, dass wir uns mit npm auskennen!\nDie Lösung - n8n-Nodes aus privaten Quellen\nWas sind Private Registries?\nNeben npm gibt es noch andere Registries, zum Beispiel die GitHub npm Registry. Diese erlaubt das Veröffentlichen privater Pakete. Wie das funktioniert, ist in der offiziellen Dokumentation zu finden, doch das soll hier keine Rolle spielen. Haben wir aber dann unsere Pakete veröffentlicht, wollen wir diese nun in n8n installieren können, und zwar ganz einfach über das Frontend.\nWie nutze ich Private Registries?\nnpm nutzt die .npmrc-Datei um andere Registries zusätzlich zu der Standard-Reqistry zu verwalten. Da n8n einfach nur npm nutzt um die Community-Nodes zu installieren, muss ausschließlich eine .npmrc an die passende Stelle abgelegt werden. Nodes werden im Ordner &lt;n8n-Ordner&gt;/nodes abgelegt. Bewegt man sich auf einer laufenden n8n-Instanz dort hinein und führt npm list aus, erhält man eine Liste aller in n8n installierten Pakete - inklusive der Community-Nodes.\n\nGenau an diesem Ort kann jetzt also eine .npmrc-Datei mit einer Referenz und einem Access-Key auf die Private Registry abgelegt werden. Im Fall einer privaten GitHub Registry sieht das wie folgt aus:\n.npmrc:\n@theitsnameless:registry=npm.pkg.github.com/\n//npm.pkg.github.com/:_authToken=&lt;github-personal-access-token&gt;\nDie erste Zeile beinhaltet den Paket-Namespace, um die Pakete dieser Quelle zu identifizieren. Da ich meine Pakete im Namespace @theitsnameless pushe, ist das der Namespace. Entsprechend wird die Einstellung registry auf die URL von GitHub gesetzt.\nDie zweite Zeile autorisiert npm, auf diese Registry zugreifen zu können, indem ein PAT2 geliefert wird.\nDiese Datei wird nun in der n8n-Instanz (zum Beispiel einem Docker-Volume) an folgender Stelle abgelegt:\n.n8n\n├── ...\n└── nodes\n    ├── node_modules\n    │   └── ...\n    ├── .npmrc            # &lt;-- .npmrc HIER ablegen\n    ├── package-lock.json\n    └── package.json\nWie installiere ich nun mein Paket?\nIn n8n unter Settings &gt; Community Nodes &gt; Install können nun Nodes hinzugefügt werden:\n\nDann das Paket inklusive Namespace installieren:\n\nUnd die Nodes hinzufügen:\n\nUnd Tada - Das Paket ist installiert! Nun lassen sich jederzeit neue Pakete hinzufügen und installieren, ohne dass diese approved oder das Image ständig neu gebaut werden muss!\nFootnotes\n\n\nNode Package Manager: Ein Paketmanager für Node ↩\n\n\nPersonal Access Token: Auth-Token, um sich ohne Passwort und 2FA für bestimmte GitHub-Dienste zu authentifizieren. ↩\n\n\n"},"Technik-Ecke/The-Stash---Quick-Fixes-für-Alles":{"slug":"Technik-Ecke/The-Stash---Quick-Fixes-für-Alles","filePath":"Technik-Ecke/The Stash - Quick Fixes für Alles.md","title":"The Stash - Quick Fixes für Alles","links":[],"tags":["how-to","server","quick-fixes"],"content":"Manchmal treten die allermerkwürdigsten Fehler auf. Ob ein Timeout beim Upload von Fotos auf Immich, TODO\nAll diese kleinen Fehler mögen einem den Tag ruinieren, doch der Fix ist oft zu kurz um dafür einen eigenen Blogeintrag zu schreiben. Genau dafür gibt es diese Seite! Hier sammle ich alle kleinen Steinchen, über die ich gestolpert bin und zeige euch, wie ich sie beheben konnte.\nTraefik 502 Bad Gateway ... i/o timeout\nHintergrund\nServices wie Immich und Nextcloud sind beliebte Tools, um Dateien zu sichern, zu organisieren und zu durchsuchen. Oftmals sind diese Dateien ziemlich groß (große Archivdateien, Videos, …).\nSymptome\nMöchte man diese Dateien nun hochladen, scheint der Upload zu funktionieren. Bis der Service einen Fehler wirft: der Upload war nicht erfolgreich. Zeitgleich erscheint in Traefik ein Fehler ähnlich zu\n502 Bad Gateway error=&quot;readfrom tcp 172.19.0.2:54726-&gt;172.19.0.15:2283: i/o timeout&quot;\nUrsache\nStandardmäßig hat Traefik einen Timeout von 60 Sekunden1. Alle Requests, die länger dauern, werden terminiert. Somit können große Dateien nicht hochgeladen werden.\nBehebung\nDas Problem lässt sich beheben, indem beim jeweiligen Traefik Entrypoint der Timeout entsprechend erhöht / entfernt wird:\n...\nentryPoints:\n\t...\n    websecure:\n        address: &#039;:443&#039;\n        # \\/ Fix \\/\n        transport:\n            respondingTimeouts:\n                readTimeout: &#039;0s&#039; # 0s deaktiviert den Timeout\n        # /\\ Fix /\\\nFootnotes\n\n\ntraefik respondingTimeouts - Timeouts, die beim beantworten von Requests gesetzt sind. Standardmäßig sind das 60 Sekunden für das Lesen des Bodies. ↩\n\n\n"},"index":{"slug":"index","filePath":"index.md","title":"ItsNameless - Jetzt als Blog!","links":["Technik-Ecke/Private-Registries-in-n8n---Nur-Besser","Technik-Ecke/Homer---Ein-Dashboard-für-dein-Server","Technik-Ecke/The-Stash---Quick-Fixes-für-Alles","Technik-Ecke/Blog-aufsetzen-leicht-gemacht","Kontakt"],"tags":["Vorstellung"],"content":"Aktuelles\nNeues aus der Welt von ItsNameless!\nPrivate Registries in n8n - Nur Besser\nHomer - Ein Dashboard für dein Server\nThe Stash - Quick Fixes für Alles\nBlog aufsetzen leicht gemacht\nVorstellung\n\nHey, schön, dass du hier bist!\nIch bin ItsNameless, in der Allgemeinheit auch als Lucas bekannt, – ein Technikfan, Tüftler und der Mensch, der immer wieder glaubt, dass meine nächste Raspberry-Pi-Tüftelei diesmal ohne Probleme funktioniert. Spoiler: Tut es selten.\nAuf diesem Blog teile ich meine Abenteuer in der Welt der Technik – und weil selbst ich nicht 24/7 mit Kabeln jonglieren kann, gibt’s ab und zu auch Geschichten von Reisen, die manchmal besser als geplant laufen (oder auch nicht), sowie ehrliche Reviews zu Dingen, die mir in die Finger kommen.\nWarum du hier lesen solltest? Gute Frage! Vielleicht findest du nützliche Tipps, vielleicht fühlst du dich einfach besser, weil deine Projekte weniger chaotisch laufen als meine. Wer weiß? Schau dich um – und lass dich überraschen!\nWhoami?\n\nitsnameless\n\nSpaß bei Seite, ich bin mehr als nur ein Pseudonym im Internet - ich bin ein echter Mensch!\nDoch was mache ich eigentlich so?\nDual Studieren, und zwar… Trommelwirbel… Informatik! Gut, das war glaube nicht so schwer zu erraten.\nAls Teil meines Dualen Studiums arbeite ich außerdem in einem E-Commerce-Unternehmen als Backend-Entwickler.\nMeine Faszination für IT reicht bis vor eine lange Zeit zurück, als ich das erste mal mit einem Lego© Mindstorms EV3-Roboter1 das Programmieren entdeckte - und einfach nicht mehr aufhören konnte. Programmieren kann echt Spaß machen. Wenn es denn funktioniert…\nUnd was mache ich hier so?\nDieser Blog ist eine Art Knowlege-Sharing-Platform, auf der ich meinen Gedanken freien Lauf lasse und alles niederschreibe, was ich so auf meinen Abenteuern erlebe. Vorrangig Technik-Abenteuer, manchmal auch Ausflüge ins Reallife.\nUnd wo gibt es mich sonst so?\nMich gibt es nicht nur hier, sondern natürlich auch auf GitHub, Reddit…\nSchau einfach mal auf meiner Social-Seite nach:\nItsNameless - Social\nWas ist die Beste Programmiersprache?\nDreamBerd!2\n\nUpdate vom 11. Februar 2025: Nach Donald Trumps Executive Order wurde die Programmiersprache umbenannt, jetzt heißt Sie:\n\nGulf of Mexico\nKannst du mir diese Website programmieren?\nNein.\nIch habe so viele Fragen!\nDas freut mich, dafür gibt es sogar ein Kontaktformular!\nUnd was jetzt?\nEine sehr philosophische Frage. Ich habe keine Ahnung. Aber schau dich ruhig in meinem Blog um, oder mach was auch immer dir Freude bereitet!\nFootnotes\n\n\nde.wikipedia.org/wiki/Lego_Mindstorms_EV3 ↩\n\n\nEs gibt so viele fantastische Programmiersprachen. Und Java. Spaß bei Seite, welche auch immer du gerne nutzt, hab Freude daran! ↩\n\n\n"}}